; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_4 ?v6 ?v10)
             (pred_8 ?v2 ?v3)
             (pred_3 ?v6 ?v3)
             (pred_7 ?v11 ?v6 )
	     (pred_5 ?v6)
             (pred_10 ?v1)
             (pred_1 ?v2)
             (pred_6 ?v3)
             (pred_11 ?v6)
             (pred_2 ?v2)
             (pred_12 ?v6)
             (pred_9 ))



(:action op_1
:parameters (?v4 ?v12 ?v7 ?v8)
:precondition (and (pred_10 ?v4) (pred_10 ?v12) (pred_1 ?v7) (pred_6 ?v8)
          (pred_4 ?v4 ?v12) (pred_8 ?v7 ?v8)
                   (pred_3 ?v12 ?v8) (pred_5 ?v4) 
                   (pred_11 ?v12) (pred_2 ?v7))
:effect (and  (pred_12 ?v12) (not (pred_11 ?v12))))


(:action op_2
:parameters (?v4 ?v13)
:precondition (and (pred_10 ?v4) (pred_10 ?v13)
               (pred_5 ?v4) (pred_4 ?v4 ?v13) (pred_12 ?v13))
:effect (and (pred_5 ?v13) (not (pred_5 ?v4))))

(:action op_5
:parameters (?v4 ?v7)
:precondition (and (pred_10 ?v4) (pred_1 ?v7) 
                  (pred_5 ?v4) (pred_7 ?v7 ?v4) (pred_9 ))
:effect (and (pred_2 ?v7)
   (not (pred_7 ?v7 ?v4)) (not (pred_9 ))))


(:action op_3
:parameters (?v4 ?v5 ?v9)
:precondition (and (pred_10 ?v4) (pred_1 ?v5) (pred_1 ?v9)
                  (pred_5 ?v4) (pred_2 ?v9) (pred_7 ?v5 ?v4))
:effect (and (pred_2 ?v5) (pred_7 ?v9 ?v4)
        (not (pred_2 ?v9)) (not (pred_7 ?v5 ?v4))))

(:action op_4
:parameters (?v4 ?v7)
:precondition (and (pred_10 ?v4) (pred_1 ?v7) 
                  (pred_5 ?v4) (pred_2 ?v7))
:effect (and (pred_9 ) (pred_7 ?v7 ?v4) (not (pred_2 ?v7)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_07 obj_06 obj_03 obj_19 obj_11 obj_13 obj_15 obj_18 obj_10 obj_09 obj_01 obj_05 obj_08 obj_17 obj_16 obj_14
    obj_04 obj_02
    obj_12 obj_20
    )

    (:init
       (pred_9)

       (pred_10 obj_07)
       (pred_10 obj_06)
       (pred_10 obj_03)
       (pred_10 obj_19)
       (pred_10 obj_11)
       (pred_10 obj_13)
       (pred_10 obj_15)
       (pred_10 obj_18)
       (pred_10 obj_10)
       (pred_10 obj_09)
       (pred_10 obj_01)
       (pred_10 obj_05)
       (pred_10 obj_08)
       (pred_10 obj_17)
       (pred_10 obj_16)
       (pred_10 obj_14)
       (pred_6 obj_04)
       (pred_6 obj_02)
       (pred_1 obj_12)
       (pred_1 obj_20)

       (pred_4 obj_07 obj_11)
       (pred_4 obj_07 obj_06)
       (pred_4 obj_06 obj_13)
       (pred_4 obj_06 obj_03)
       (pred_4 obj_06 obj_07)
       (pred_4 obj_03 obj_15)
       (pred_4 obj_03 obj_19)
       (pred_4 obj_03 obj_06)
       (pred_4 obj_19 obj_18)
       (pred_4 obj_19 obj_03)
       (pred_4 obj_11 obj_10)
       (pred_4 obj_11 obj_13)
       (pred_4 obj_11 obj_07)
       (pred_4 obj_13 obj_09)
       (pred_4 obj_13 obj_15)
       (pred_4 obj_13 obj_06)
       (pred_4 obj_13 obj_11)
       (pred_4 obj_15 obj_01)
       (pred_4 obj_15 obj_18)
       (pred_4 obj_15 obj_03)
       (pred_4 obj_15 obj_13)
       (pred_4 obj_18 obj_05)
       (pred_4 obj_18 obj_19)
       (pred_4 obj_18 obj_15)
       (pred_4 obj_10 obj_08)
       (pred_4 obj_10 obj_09)
       (pred_4 obj_10 obj_11)
       (pred_4 obj_09 obj_17)
       (pred_4 obj_09 obj_01)
       (pred_4 obj_09 obj_13)
       (pred_4 obj_09 obj_10)
       (pred_4 obj_01 obj_16)
       (pred_4 obj_01 obj_05)
       (pred_4 obj_01 obj_15)
       (pred_4 obj_01 obj_09)
       (pred_4 obj_05 obj_14)
       (pred_4 obj_05 obj_18)
       (pred_4 obj_05 obj_01)
       (pred_4 obj_08 obj_17)
       (pred_4 obj_08 obj_10)
       (pred_4 obj_17 obj_16)
       (pred_4 obj_17 obj_09)
       (pred_4 obj_17 obj_08)
       (pred_4 obj_16 obj_14)
       (pred_4 obj_16 obj_01)
       (pred_4 obj_16 obj_17)
       (pred_4 obj_14 obj_05)
       (pred_4 obj_14 obj_16)
       (pred_11 obj_19)
       (pred_11 obj_09)
       (pred_3  obj_19 obj_04)
       (pred_3  obj_09 obj_02)
       (pred_12 obj_07)
       (pred_12 obj_06)
       (pred_12 obj_03)
       (pred_12 obj_11)
       (pred_12 obj_13)
       (pred_12 obj_15)
       (pred_12 obj_18)
       (pred_12 obj_10)
       (pred_12 obj_01)
       (pred_12 obj_05)
       (pred_12 obj_08)
       (pred_12 obj_17)
       (pred_12 obj_16)
       (pred_12 obj_14)

       (pred_8  obj_12 obj_04)
       (pred_8  obj_20 obj_02)
       (pred_7 obj_12 obj_07)
       (pred_7 obj_20 obj_18)
       (pred_5 obj_11)
    )

    (:goal (and
       (pred_7 obj_20 obj_01)
    ))
(:constraints
  (always (not (pred_5 obj_15)))
)
)

; plan
1. (op_2 obj_11 obj_07)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_07)
   goals met: 0 of 1
2. (op_5 obj_07 obj_12)
   deleted: (pred_7 obj_12 obj_07) (pred_9)
   added: (pred_2 obj_12)
   goals met: 0 of 1
3. (op_2 obj_07 obj_06)
   deleted: (pred_5 obj_07)
   added: (pred_5 obj_06)
   goals met: 0 of 1
4. (op_2 obj_06 obj_03)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_03)
   goals met: 0 of 1
5. (op_1 obj_03 obj_19 obj_12 obj_04)
   deleted: (pred_11 obj_19)
   added: (pred_12 obj_19)
   goals met: 0 of 1
6. (op_2 obj_03 obj_19)
   deleted: (pred_5 obj_03)
   added: (pred_5 obj_19)
   goals met: 0 of 1
7. (op_2 obj_19 obj_18)
   deleted: (pred_5 obj_19)
   added: (pred_5 obj_18)
   goals met: 0 of 1
8. (op_3 obj_18 obj_20 obj_12)
   deleted: (pred_2 obj_12) (pred_7 obj_20 obj_18)
   added: (pred_2 obj_20) (pred_7 obj_12 obj_18)
   goals met: 0 of 1
9. (op_2 obj_18 obj_05)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_05)
   goals met: 0 of 1
10. (op_2 obj_05 obj_01)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_01)
   goals met: 0 of 1
11. (op_4 obj_01 obj_20)
   deleted: (pred_2 obj_20)
   added: (pred_9) (pred_7 obj_20 obj_01)
   goals met: 1 of 1
